docs/k6-50vus-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 324 complete and 0 interrupted iterations
default   [   1% ] 50 VUs  0m01.0s/2m0s

running (0m02.0s), 50/50 VUs, 689 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m02.0s/2m0s

running (0m03.0s), 50/50 VUs, 1067 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m03.0s/2m0s

running (0m04.0s), 50/50 VUs, 1440 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m04.0s/2m0s

running (0m05.0s), 50/50 VUs, 1808 complete and 0 interrupted iterations
default   [   4% ] 50 VUs  0m05.0s/2m0s

running (0m06.0s), 50/50 VUs, 2172 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m06.0s/2m0s

running (0m07.0s), 50/50 VUs, 2529 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  0m07.0s/2m0s

running (0m08.0s), 50/50 VUs, 2911 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m08.0s/2m0s

running (0m09.0s), 50/50 VUs, 3272 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m09.0s/2m0s

running (0m10.0s), 50/50 VUs, 3651 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m10.0s/2m0s

running (0m11.0s), 50/50 VUs, 4024 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  0m11.0s/2m0s

running (0m12.0s), 50/50 VUs, 4408 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m12.0s/2m0s

running (0m13.0s), 50/50 VUs, 4771 complete and 0 interrupted iterations
default   [  11% ] 50 VUs  0m13.0s/2m0s

running (0m14.0s), 50/50 VUs, 5139 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m14.0s/2m0s

running (0m15.0s), 50/50 VUs, 5516 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m15.0s/2m0s

running (0m16.0s), 50/50 VUs, 5891 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m16.0s/2m0s

running (0m17.0s), 50/50 VUs, 6253 complete and 0 interrupted iterations
default   [  14% ] 50 VUs  0m17.0s/2m0s

running (0m18.0s), 50/50 VUs, 6626 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m18.0s/2m0s

running (0m19.0s), 50/50 VUs, 6995 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  0m19.0s/2m0s

running (0m20.0s), 50/50 VUs, 7376 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m20.0s/2m0s

running (0m21.0s), 50/50 VUs, 7741 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m21.0s/2m0s

running (0m22.0s), 50/50 VUs, 8097 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m22.0s/2m0s

running (0m23.0s), 50/50 VUs, 8448 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  0m23.0s/2m0s

running (0m24.0s), 50/50 VUs, 8806 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m24.0s/2m0s

running (0m25.0s), 50/50 VUs, 9172 complete and 0 interrupted iterations
default   [  21% ] 50 VUs  0m25.0s/2m0s

running (0m26.0s), 50/50 VUs, 9548 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m26.0s/2m0s

running (0m27.0s), 50/50 VUs, 9917 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m27.0s/2m0s

running (0m28.0s), 50/50 VUs, 10271 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m28.0s/2m0s

running (0m29.0s), 50/50 VUs, 10645 complete and 0 interrupted iterations
default   [  24% ] 50 VUs  0m29.0s/2m0s

running (0m30.0s), 50/50 VUs, 11009 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m30.0s/2m0s

running (0m31.0s), 50/50 VUs, 11388 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  0m31.0s/2m0s

running (0m32.0s), 50/50 VUs, 11762 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m32.0s/2m0s

running (0m33.0s), 50/50 VUs, 12119 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m33.0s/2m0s

running (0m34.0s), 50/50 VUs, 12491 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m34.0s/2m0s

running (0m35.0s), 50/50 VUs, 12861 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  0m35.0s/2m0s

running (0m36.0s), 50/50 VUs, 13232 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m36.0s/2m0s

running (0m37.0s), 50/50 VUs, 13599 complete and 0 interrupted iterations
default   [  31% ] 50 VUs  0m37.0s/2m0s

running (0m38.0s), 50/50 VUs, 13969 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m38.0s/2m0s

running (0m39.0s), 50/50 VUs, 14330 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m39.0s/2m0s

running (0m40.0s), 50/50 VUs, 14692 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m40.0s/2m0s

running (0m41.0s), 50/50 VUs, 15053 complete and 0 interrupted iterations
default   [  34% ] 50 VUs  0m41.0s/2m0s

running (0m42.0s), 50/50 VUs, 15406 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m42.0s/2m0s

running (0m43.0s), 50/50 VUs, 15760 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  0m43.0s/2m0s

running (0m44.0s), 50/50 VUs, 16127 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m44.0s/2m0s

running (0m45.0s), 50/50 VUs, 16487 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m45.0s/2m0s

running (0m46.0s), 50/50 VUs, 16827 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m46.0s/2m0s

running (0m47.0s), 50/50 VUs, 17182 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  0m47.0s/2m0s

running (0m48.0s), 50/50 VUs, 17527 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m48.0s/2m0s

running (0m49.0s), 50/50 VUs, 17884 complete and 0 interrupted iterations
default   [  41% ] 50 VUs  0m49.0s/2m0s

running (0m50.0s), 50/50 VUs, 18254 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m50.0s/2m0s

running (0m51.0s), 50/50 VUs, 18616 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m51.0s/2m0s

running (0m52.0s), 50/50 VUs, 18961 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m52.0s/2m0s

running (0m53.0s), 50/50 VUs, 19328 complete and 0 interrupted iterations
default   [  44% ] 50 VUs  0m53.0s/2m0s

running (0m54.0s), 50/50 VUs, 19687 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m54.0s/2m0s

running (0m55.0s), 50/50 VUs, 20029 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  0m55.0s/2m0s

running (0m56.0s), 50/50 VUs, 20399 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m56.0s/2m0s

running (0m57.0s), 50/50 VUs, 20755 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m57.0s/2m0s

running (0m58.0s), 50/50 VUs, 21114 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m58.0s/2m0s

running (0m59.0s), 50/50 VUs, 21479 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  0m59.0s/2m0s

running (1m00.0s), 50/50 VUs, 21841 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  1m00.0s/2m0s

running (1m01.0s), 50/50 VUs, 22191 complete and 0 interrupted iterations
default   [  51% ] 50 VUs  1m01.0s/2m0s

running (1m02.0s), 50/50 VUs, 22544 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m02.0s/2m0s

running (1m03.0s), 50/50 VUs, 22891 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  1m03.0s/2m0s

running (1m04.0s), 50/50 VUs, 23252 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  1m04.0s/2m0s

running (1m05.0s), 50/50 VUs, 23615 complete and 0 interrupted iterations
default   [  54% ] 50 VUs  1m05.0s/2m0s

running (1m06.0s), 50/50 VUs, 23985 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  1m06.0s/2m0s

running (1m07.0s), 50/50 VUs, 24361 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  1m07.0s/2m0s

running (1m08.0s), 50/50 VUs, 24731 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m08.0s/2m0s

running (1m09.0s), 50/50 VUs, 25085 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  1m09.0s/2m0s

running (1m10.0s), 50/50 VUs, 25466 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  1m10.0s/2m0s

running (1m11.0s), 50/50 VUs, 25828 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  1m11.0s/2m0s

running (1m12.0s), 50/50 VUs, 26203 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  1m12.0s/2m0s

running (1m13.0s), 50/50 VUs, 26566 complete and 0 interrupted iterations
default   [  61% ] 50 VUs  1m13.0s/2m0s

running (1m14.0s), 50/50 VUs, 26935 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m14.0s/2m0s

running (1m15.0s), 50/50 VUs, 27306 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  1m15.0s/2m0s

running (1m16.0s), 50/50 VUs, 27663 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  1m16.0s/2m0s

running (1m17.0s), 50/50 VUs, 28027 complete and 0 interrupted iterations
default   [  64% ] 50 VUs  1m17.0s/2m0s

running (1m18.0s), 50/50 VUs, 28390 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  1m18.0s/2m0s

running (1m19.0s), 50/50 VUs, 28775 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  1m19.0s/2m0s

running (1m20.0s), 50/50 VUs, 29148 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m20.0s/2m0s

running (1m21.0s), 50/50 VUs, 29500 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  1m21.0s/2m0s

running (1m22.0s), 50/50 VUs, 29870 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  1m22.0s/2m0s

running (1m23.0s), 50/50 VUs, 30211 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  1m23.0s/2m0s

running (1m24.0s), 50/50 VUs, 30601 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  1m24.0s/2m0s

running (1m25.0s), 50/50 VUs, 30984 complete and 0 interrupted iterations
default   [  71% ] 50 VUs  1m25.0s/2m0s

running (1m26.0s), 50/50 VUs, 31354 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m26.0s/2m0s

running (1m27.0s), 50/50 VUs, 31741 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  1m27.0s/2m0s

running (1m28.0s), 50/50 VUs, 32112 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  1m28.0s/2m0s

running (1m29.0s), 50/50 VUs, 32469 complete and 0 interrupted iterations
default   [  74% ] 50 VUs  1m29.0s/2m0s

running (1m30.0s), 50/50 VUs, 32838 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  1m30.0s/2m0s

running (1m31.0s), 50/50 VUs, 33198 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  1m31.0s/2m0s

running (1m32.0s), 50/50 VUs, 33552 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m32.0s/2m0s

running (1m33.0s), 50/50 VUs, 33932 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  1m33.0s/2m0s

running (1m34.0s), 50/50 VUs, 34308 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  1m34.0s/2m0s

running (1m35.0s), 50/50 VUs, 34662 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  1m35.0s/2m0s

running (1m36.0s), 50/50 VUs, 35030 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  1m36.0s/2m0s

running (1m37.0s), 50/50 VUs, 35399 complete and 0 interrupted iterations
default   [  81% ] 50 VUs  1m37.0s/2m0s

running (1m38.0s), 50/50 VUs, 35753 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m38.0s/2m0s

running (1m39.0s), 50/50 VUs, 36120 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  1m39.0s/2m0s

running (1m40.0s), 50/50 VUs, 36484 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  1m40.0s/2m0s

running (1m41.0s), 50/50 VUs, 36852 complete and 0 interrupted iterations
default   [  84% ] 50 VUs  1m41.0s/2m0s

running (1m42.0s), 50/50 VUs, 37226 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  1m42.0s/2m0s

running (1m43.0s), 50/50 VUs, 37590 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  1m43.0s/2m0s

running (1m44.0s), 50/50 VUs, 37961 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m44.0s/2m0s

running (1m45.0s), 50/50 VUs, 38311 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  1m45.0s/2m0s

running (1m46.0s), 50/50 VUs, 38682 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  1m46.0s/2m0s

running (1m47.0s), 50/50 VUs, 39044 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  1m47.0s/2m0s

running (1m48.0s), 50/50 VUs, 39402 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  1m48.0s/2m0s

running (1m49.0s), 50/50 VUs, 39755 complete and 0 interrupted iterations
default   [  91% ] 50 VUs  1m49.0s/2m0s

running (1m50.0s), 50/50 VUs, 40119 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m50.0s/2m0s

running (1m51.0s), 50/50 VUs, 40469 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  1m51.0s/2m0s

running (1m52.0s), 50/50 VUs, 40829 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  1m52.0s/2m0s

running (1m53.0s), 50/50 VUs, 41187 complete and 0 interrupted iterations
default   [  94% ] 50 VUs  1m53.0s/2m0s

running (1m54.0s), 50/50 VUs, 41549 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  1m54.0s/2m0s

running (1m55.0s), 50/50 VUs, 41901 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  1m55.0s/2m0s

running (1m56.0s), 50/50 VUs, 42259 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m56.0s/2m0s

running (1m57.0s), 50/50 VUs, 42624 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  1m57.0s/2m0s

running (1m58.0s), 50/50 VUs, 42974 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  1m58.0s/2m0s

running (1m59.0s), 50/50 VUs, 43337 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  1m59.0s/2m0s

running (2m00.0s), 50/50 VUs, 43688 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  2m00.0s/2m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(99)<1000' p(99)=12.93ms
    ✓ 'p(95)<500' p(95)=7.32ms

      {scenario:default}
      ✓ 'p(95)<500' p(95)=7.32ms
      ✓ 'p(99)<1000' p(99)=12.93ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.01%


  █ TOTAL RESULTS 

    checks_total.......: 46794  388.871762/s
    checks_succeeded...: 99.98% 46786 out of 46794
    checks_failed......: 0.01%  8 out of 46794

    ✗ resolve short code: status 200 or 404
      ↳  99% — ✓ 34995 / ✗ 6
    ✗ get url: status 200 or 404
      ↳  99% — ✓ 4390 / ✗ 2
    ✓ create url: status 201
    ✓ create url: has id
    ✓ create event: status 201

    HTTP
    http_req_duration..............: avg=3.22ms   min=856.26µs med=2.42ms   max=83.34ms  p(90)=5.89ms   p(95)=7.32ms  
      { expected_response:true }...: avg=3.2ms    min=856.26µs med=2.42ms   max=83.34ms  p(90)=5.89ms   p(95)=7.31ms  
      { scenario:default }.........: avg=3.22ms   min=856.26µs med=2.42ms   max=83.34ms  p(90)=5.89ms   p(95)=7.32ms  
    http_req_failed................: 0.01%  8 out of 43740
    http_reqs......................: 43740  363.492133/s

    EXECUTION
    iteration_duration.............: avg=137.24ms min=51.25ms  med=131.13ms max=449.77ms p(90)=196.94ms p(95)=234.95ms
    iterations.....................: 43740  363.492133/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 11 MB  89 kB/s
    data_sent......................: 4.4 MB 37 kB/s



running (2m00.3s), 00/50 VUs, 43740 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s